{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "1425d87e",
   "metadata": {},
   "source": [
    "# Graph Path Algorithms"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "11efd6ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "from IPython.display import display"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "f75af7e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = neo4j.GraphDatabase.driver(uri=\"neo4j://neo4j:7687\", auth=(\"neo4j\",\"ucb_mids_w205\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f3284b9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "session = driver.session(database=\"neo4j\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "31c4a79a",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_wipe_out_database():\n",
    "    \"wipe out database by deleting all nodes and relationships\"\n",
    "    \n",
    "    query = \"match (node)-[relationship]->() delete node, relationship\"\n",
    "    session.run(query)\n",
    "    \n",
    "    query = \"match (node) delete node\"\n",
    "    session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "b845642b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_run_query_pandas(query, **kwargs):\n",
    "    \"run a query and return the results in a pandas dataframe\"\n",
    "    \n",
    "    result = session.run(query, **kwargs)\n",
    "    \n",
    "    df = pd.DataFrame([r.values() for r in result], columns=result.keys())\n",
    "    \n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "579645ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_nodes_relationships():\n",
    "    \"print all the nodes and relationships\"\n",
    "   \n",
    "    print(\"-------------------------\")\n",
    "    print(\"  Nodes:\")\n",
    "    print(\"-------------------------\")\n",
    "    \n",
    "    query = \"\"\"\n",
    "        match (n) \n",
    "        return n.name as node_name, labels(n) as labels\n",
    "        order by n.name\n",
    "    \"\"\"\n",
    "    \n",
    "    df = my_neo4j_run_query_pandas(query)\n",
    "    \n",
    "    number_nodes = df.shape[0]\n",
    "    \n",
    "    display(df)\n",
    "    \n",
    "    print(\"-------------------------\")\n",
    "    print(\"  Relationships:\")\n",
    "    print(\"-------------------------\")\n",
    "    \n",
    "    query = \"\"\"\n",
    "        match (n1)-[r]->(n2) \n",
    "        return n1.name as node_name_1, labels(n1) as node_1_labels, \n",
    "            type(r) as relationship_type, n2.name as node_name_2, labels(n2) as node_2_labels\n",
    "        order by node_name_1, node_name_2\n",
    "    \"\"\"\n",
    "    \n",
    "    df = my_neo4j_run_query_pandas(query)\n",
    "    \n",
    "    number_relationships = df.shape[0]\n",
    "    \n",
    "    display(df)\n",
    "    \n",
    "    density = (2 * number_relationships) / (number_nodes * (number_nodes - 1))\n",
    "    \n",
    "    print(\"-------------------------\")\n",
    "    print(\"  Density:\", f'{density:.1f}')\n",
    "    print(\"-------------------------\")\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9c39c25e",
   "metadata": {},
   "source": [
    "# Lab: Neo4j - Shortest Path, A Star, Yen's"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "82d60caa",
   "metadata": {},
   "source": [
    "## Assume we have a new high speed train rolled out to 9 cities across the USA; the path finding algorithms are directional, so we need to create the relationships in both directions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "5fa4738e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973c3d820>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "my_neo4j_wipe_out_database()\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "CREATE\n",
    "  (seattle:Station {name: 'Seattle', latitude: 47.6062, longitude: -122.3321}),\n",
    "  (berkeley:Station {name: 'Berkeley', latitude: 37.8715, longitude: -122.2730}),\n",
    "  (losangeles:Station {name: 'Los Angeles', latitude: 34.0522, longitude: -118.2437}),\n",
    "  (denver:Station {name: 'Denver', latitude: 39.7392, longitude: -104.9903}),\n",
    "  (dallas:Station {name: 'Dallas', latitude: 32.7767, longitude: -96.7970}),\n",
    "  (chicago:Station {name: 'Chicago', latitude: 41.8781, longitude: -87.6298}),\n",
    "  (newyork:Station {name: 'New York', latitude: 40.7128, longitude: -74.0060}),\n",
    "  (washington:Station {name: 'Washington', latitude: 38.9072, longitude: -77.0369}),\n",
    "  (miami:Station {name: 'Miami', latitude: 25.7617, longitude: -80.1918}),\n",
    "  (seattle)-[:TRACK {track_miles: 798}]->(berkeley),\n",
    "  (berkeley)-[:TRACK {track_miles: 798}]->(seattle),\n",
    "  (seattle)-[:TRACK {track_miles: 1303}]->(denver),\n",
    "  (denver)-[:TRACK {track_miles: 1303}]->(seattle),\n",
    "  (berkeley)-[:TRACK {track_miles: 1240}]->(denver),\n",
    "  (denver)-[:TRACK {track_miles: 1240}]->(berkeley),\n",
    "  (berkeley)-[:TRACK {track_miles: 376}]->(losangeles),\n",
    "  (losangeles)-[:TRACK {track_miles: 376}]->(berkeley),\n",
    "  (losangeles)-[:TRACK {track_miles: 1436}]->(dallas),\n",
    "  (dallas)-[:TRACK {track_miles: 1436}]->(losangeles),\n",
    "  (denver)-[:TRACK {track_miles: 1003}]->(chicago),\n",
    "  (chicago)-[:TRACK {track_miles: 1003}]->(denver),\n",
    "  (denver)-[:TRACK {track_miles: 794}]->(dallas),\n",
    "  (dallas)-[:TRACK {track_miles: 794}]->(denver),\n",
    "  (chicago)-[:TRACK {track_miles: 794}]->(newyork),\n",
    "  (newyork)-[:TRACK {track_miles: 794}]->(chicago),\n",
    "  (dallas)-[:TRACK {track_miles: 1329}]->(washington),\n",
    "  (washington)-[:TRACK {track_miles: 1329}]->(dallas),\n",
    "  (newyork)-[:TRACK {track_miles: 226}]->(washington),\n",
    "  (washington)-[:TRACK {track_miles: 226}]->(newyork),\n",
    "  (washington)-[:TRACK {track_miles: 1053}]->(miami),\n",
    "  (miami)-[:TRACK {track_miles: 1053}]->(washington)\n",
    "  \n",
    "\"\"\"\n",
    "\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "ca20836e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes:\n",
      "-------------------------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node_name</th>\n",
       "      <th>labels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Dallas</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Denver</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Miami</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>New York</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Washington</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     node_name     labels\n",
       "0     Berkeley  [Station]\n",
       "1      Chicago  [Station]\n",
       "2       Dallas  [Station]\n",
       "3       Denver  [Station]\n",
       "4  Los Angeles  [Station]\n",
       "5        Miami  [Station]\n",
       "6     New York  [Station]\n",
       "7      Seattle  [Station]\n",
       "8   Washington  [Station]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Relationships:\n",
      "-------------------------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node_name_1</th>\n",
       "      <th>node_1_labels</th>\n",
       "      <th>relationship_type</th>\n",
       "      <th>node_name_2</th>\n",
       "      <th>node_2_labels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Denver</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Seattle</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Denver</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>New York</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dallas</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Denver</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Dallas</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Dallas</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Washington</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Denver</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Denver</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Chicago</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Denver</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Dallas</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Denver</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Seattle</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Dallas</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Miami</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Washington</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>New York</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Chicago</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>New York</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Washington</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Denver</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Washington</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Dallas</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Washington</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>Miami</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Washington</td>\n",
       "      <td>[Station]</td>\n",
       "      <td>TRACK</td>\n",
       "      <td>New York</td>\n",
       "      <td>[Station]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    node_name_1 node_1_labels relationship_type  node_name_2 node_2_labels\n",
       "0      Berkeley     [Station]             TRACK       Denver     [Station]\n",
       "1      Berkeley     [Station]             TRACK  Los Angeles     [Station]\n",
       "2      Berkeley     [Station]             TRACK      Seattle     [Station]\n",
       "3       Chicago     [Station]             TRACK       Denver     [Station]\n",
       "4       Chicago     [Station]             TRACK     New York     [Station]\n",
       "5        Dallas     [Station]             TRACK       Denver     [Station]\n",
       "6        Dallas     [Station]             TRACK  Los Angeles     [Station]\n",
       "7        Dallas     [Station]             TRACK   Washington     [Station]\n",
       "8        Denver     [Station]             TRACK     Berkeley     [Station]\n",
       "9        Denver     [Station]             TRACK      Chicago     [Station]\n",
       "10       Denver     [Station]             TRACK       Dallas     [Station]\n",
       "11       Denver     [Station]             TRACK      Seattle     [Station]\n",
       "12  Los Angeles     [Station]             TRACK     Berkeley     [Station]\n",
       "13  Los Angeles     [Station]             TRACK       Dallas     [Station]\n",
       "14        Miami     [Station]             TRACK   Washington     [Station]\n",
       "15     New York     [Station]             TRACK      Chicago     [Station]\n",
       "16     New York     [Station]             TRACK   Washington     [Station]\n",
       "17      Seattle     [Station]             TRACK     Berkeley     [Station]\n",
       "18      Seattle     [Station]             TRACK       Denver     [Station]\n",
       "19   Washington     [Station]             TRACK       Dallas     [Station]\n",
       "20   Washington     [Station]             TRACK        Miami     [Station]\n",
       "21   Washington     [Station]             TRACK     New York     [Station]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Density: 0.6\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "my_neo4j_nodes_relationships()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d02faf57",
   "metadata": {},
   "source": [
    "## Shortest Path (Dijkstra's algorithm) - find the shortest path between two nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "ba2c308d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973be6b50>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Station', 'TRACK', {relationshipProperties: 'track_miles'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "88d01539",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>from</th>\n",
       "      <th>to</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodes</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>4194.0</td>\n",
       "      <td>[Berkeley, Los Angeles, Dallas, Washington, Mi...</td>\n",
       "      <td>[0.0, 376.0, 1812.0, 3141.0, 4194.0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       from     to  totalCost  \\\n",
       "0  Berkeley  Miami     4194.0   \n",
       "\n",
       "                                               nodes  \\\n",
       "0  [Berkeley, Los Angeles, Dallas, Washington, Mi...   \n",
       "\n",
       "                                  costs  \n",
       "0  [0.0, 376.0, 1812.0, 3141.0, 4194.0]  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.dijkstra.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source, \n",
    "      targetNode: target, \n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    gds.util.asNode(sourceNode).name AS from,\n",
    "    gds.util.asNode(targetNode).name AS to,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodes,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Berkeley\"\n",
    "target = \"Miami\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "d3a23023",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>from</th>\n",
       "      <th>to</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodes</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Miami</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>4194.0</td>\n",
       "      <td>[Miami, Washington, Dallas, Los Angeles, Berke...</td>\n",
       "      <td>[0.0, 1053.0, 2382.0, 3818.0, 4194.0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    from        to  totalCost  \\\n",
       "0  Miami  Berkeley     4194.0   \n",
       "\n",
       "                                               nodes  \\\n",
       "0  [Miami, Washington, Dallas, Los Angeles, Berke...   \n",
       "\n",
       "                                   costs  \n",
       "0  [0.0, 1053.0, 2382.0, 3818.0, 4194.0]  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.dijkstra.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source, \n",
    "      targetNode: target, \n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    gds.util.asNode(sourceNode).name AS from,\n",
    "    gds.util.asNode(targetNode).name AS to,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodes,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Miami\"\n",
    "target = \"Berkeley\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "07d81450",
   "metadata": {},
   "source": [
    "## A Star - variation of Dijkstra; uses a heuristic function; while constructing the path, at each step estimates the cost to the destination using the heuristic;  faster than Dijkstra, but no guarantee of accuracy; in this implementation the heuristic requires a latitude and longitude for each node and uses great circle distance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "516e2367",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973bbefd0>"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "CALL gds.graph.project('ds_graph', 'Station', 'TRACK', \n",
    "                      {nodeProperties: ['latitude', 'longitude'],\n",
    "                      relationshipProperties: 'track_miles'})\n",
    "\n",
    "\"\"\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "3c9cc8d3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>4194.0</td>\n",
       "      <td>[Berkeley, Los Angeles, Dallas, Washington, Mi...</td>\n",
       "      <td>[0.0, 376.0, 1812.0, 3141.0, 4194.0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0       Berkeley          Miami     4194.0   \n",
       "\n",
       "                                           nodeNames  \\\n",
       "0  [Berkeley, Los Angeles, Dallas, Washington, Mi...   \n",
       "\n",
       "                                  costs  \n",
       "0  [0.0, 376.0, 1812.0, 3141.0, 4194.0]  "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.astar.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source,\n",
    "      targetNode: target,\n",
    "      latitudeProperty: 'latitude',\n",
    "      longitudeProperty: 'longitude',\n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "     }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).name AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).name AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodeNames,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Berkeley\"\n",
    "target = \"Miami\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "e737d741",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Miami</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>4194.0</td>\n",
       "      <td>[Miami, Washington, Dallas, Los Angeles, Berke...</td>\n",
       "      <td>[0.0, 1053.0, 2382.0, 3818.0, 4194.0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0          Miami       Berkeley     4194.0   \n",
       "\n",
       "                                           nodeNames  \\\n",
       "0  [Miami, Washington, Dallas, Los Angeles, Berke...   \n",
       "\n",
       "                                   costs  \n",
       "0  [0.0, 1053.0, 2382.0, 3818.0, 4194.0]  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.astar.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source,\n",
    "      targetNode: target,\n",
    "      latitudeProperty: 'latitude',\n",
    "      longitudeProperty: 'longitude',\n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).name AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).name AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodeNames,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Miami\"\n",
    "target = \"Berkeley\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5eda9429",
   "metadata": {},
   "source": [
    "## Yen's - finds k shortest paths between two nodes; for k = 1, it's the same as Dijkstra; for k=2 it returns the shorest and 2nd shorest path; for k = 3, the 3 shortest paths; useful for when we want alternatives "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "e2afe479",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973bbee20>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Station', 'TRACK', {relationshipProperties: 'track_miles'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "929cfeb8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>4194.0</td>\n",
       "      <td>[Berkeley, Los Angeles, Dallas, Washington, Mi...</td>\n",
       "      <td>[0.0, 376.0, 1812.0, 3141.0, 4194.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>4316.0</td>\n",
       "      <td>[Berkeley, Denver, Chicago, New York, Washingt...</td>\n",
       "      <td>[0.0, 1240.0, 2243.0, 3037.0, 3263.0, 4316.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>4416.0</td>\n",
       "      <td>[Berkeley, Denver, Dallas, Washington, Miami]</td>\n",
       "      <td>[0.0, 1240.0, 2034.0, 3363.0, 4416.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>5177.0</td>\n",
       "      <td>[Berkeley, Seattle, Denver, Chicago, New York,...</td>\n",
       "      <td>[0.0, 798.0, 2101.0, 3104.0, 3898.0, 4124.0, 5...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>5277.0</td>\n",
       "      <td>[Berkeley, Seattle, Denver, Dallas, Washington...</td>\n",
       "      <td>[0.0, 798.0, 2101.0, 2895.0, 4224.0, 5277.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>5682.0</td>\n",
       "      <td>[Berkeley, Los Angeles, Dallas, Denver, Chicag...</td>\n",
       "      <td>[0.0, 376.0, 1812.0, 2606.0, 3609.0, 4403.0, 4...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0       Berkeley          Miami     4194.0   \n",
       "1      1       Berkeley          Miami     4316.0   \n",
       "2      2       Berkeley          Miami     4416.0   \n",
       "3      3       Berkeley          Miami     5177.0   \n",
       "4      4       Berkeley          Miami     5277.0   \n",
       "5      5       Berkeley          Miami     5682.0   \n",
       "\n",
       "                                           nodeNames  \\\n",
       "0  [Berkeley, Los Angeles, Dallas, Washington, Mi...   \n",
       "1  [Berkeley, Denver, Chicago, New York, Washingt...   \n",
       "2      [Berkeley, Denver, Dallas, Washington, Miami]   \n",
       "3  [Berkeley, Seattle, Denver, Chicago, New York,...   \n",
       "4  [Berkeley, Seattle, Denver, Dallas, Washington...   \n",
       "5  [Berkeley, Los Angeles, Dallas, Denver, Chicag...   \n",
       "\n",
       "                                               costs  \n",
       "0               [0.0, 376.0, 1812.0, 3141.0, 4194.0]  \n",
       "1      [0.0, 1240.0, 2243.0, 3037.0, 3263.0, 4316.0]  \n",
       "2              [0.0, 1240.0, 2034.0, 3363.0, 4416.0]  \n",
       "3  [0.0, 798.0, 2101.0, 3104.0, 3898.0, 4124.0, 5...  \n",
       "4       [0.0, 798.0, 2101.0, 2895.0, 4224.0, 5277.0]  \n",
       "5  [0.0, 376.0, 1812.0, 2606.0, 3609.0, 4403.0, 4...  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.yens.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source,\n",
    "      targetNode: target,\n",
    "      k: $k,\n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).name AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).name AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodeNames,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Berkeley\"\n",
    "target = \"Miami\"\n",
    "k = 10\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target, k=k)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "703684b6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Miami</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>4194.0</td>\n",
       "      <td>[Miami, Washington, Dallas, Los Angeles, Berke...</td>\n",
       "      <td>[0.0, 1053.0, 2382.0, 3818.0, 4194.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Miami</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>4316.0</td>\n",
       "      <td>[Miami, Washington, New York, Chicago, Denver,...</td>\n",
       "      <td>[0.0, 1053.0, 1279.0, 2073.0, 3076.0, 4316.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>Miami</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>4416.0</td>\n",
       "      <td>[Miami, Washington, Dallas, Denver, Berkeley]</td>\n",
       "      <td>[0.0, 1053.0, 2382.0, 3176.0, 4416.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>Miami</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>5177.0</td>\n",
       "      <td>[Miami, Washington, New York, Chicago, Denver,...</td>\n",
       "      <td>[0.0, 1053.0, 1279.0, 2073.0, 3076.0, 4379.0, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>Miami</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>5277.0</td>\n",
       "      <td>[Miami, Washington, Dallas, Denver, Seattle, B...</td>\n",
       "      <td>[0.0, 1053.0, 2382.0, 3176.0, 4479.0, 5277.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>Miami</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>5682.0</td>\n",
       "      <td>[Miami, Washington, New York, Chicago, Denver,...</td>\n",
       "      <td>[0.0, 1053.0, 1279.0, 2073.0, 3076.0, 3870.0, ...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0          Miami       Berkeley     4194.0   \n",
       "1      1          Miami       Berkeley     4316.0   \n",
       "2      2          Miami       Berkeley     4416.0   \n",
       "3      3          Miami       Berkeley     5177.0   \n",
       "4      4          Miami       Berkeley     5277.0   \n",
       "5      5          Miami       Berkeley     5682.0   \n",
       "\n",
       "                                           nodeNames  \\\n",
       "0  [Miami, Washington, Dallas, Los Angeles, Berke...   \n",
       "1  [Miami, Washington, New York, Chicago, Denver,...   \n",
       "2      [Miami, Washington, Dallas, Denver, Berkeley]   \n",
       "3  [Miami, Washington, New York, Chicago, Denver,...   \n",
       "4  [Miami, Washington, Dallas, Denver, Seattle, B...   \n",
       "5  [Miami, Washington, New York, Chicago, Denver,...   \n",
       "\n",
       "                                               costs  \n",
       "0              [0.0, 1053.0, 2382.0, 3818.0, 4194.0]  \n",
       "1      [0.0, 1053.0, 1279.0, 2073.0, 3076.0, 4316.0]  \n",
       "2              [0.0, 1053.0, 2382.0, 3176.0, 4416.0]  \n",
       "3  [0.0, 1053.0, 1279.0, 2073.0, 3076.0, 4379.0, ...  \n",
       "4      [0.0, 1053.0, 2382.0, 3176.0, 4479.0, 5277.0]  \n",
       "5  [0.0, 1053.0, 1279.0, 2073.0, 3076.0, 3870.0, ...  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.yens.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source,\n",
    "      targetNode: target,\n",
    "      k: $k,\n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).name AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).name AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodeNames,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Miami\"\n",
    "target = \"Berkeley\"\n",
    "k = 10\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target, k=k)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "266af574",
   "metadata": {},
   "source": [
    "## You try it - find the shortest path using Dijkstra, A Star, and Yen's (for up to 10 paths) for Los Angeles to New York and return New York to Los Angeles; solutions in graph_path_algorithm_solutions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "5dbbfb9b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973b56e80>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Station', 'TRACK', {relationshipProperties: 'track_miles'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "9037e523",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>from</th>\n",
       "      <th>to</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodes</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>New York</td>\n",
       "      <td>2991.0</td>\n",
       "      <td>[Los Angeles, Dallas, Washington, New York]</td>\n",
       "      <td>[0.0, 1436.0, 2765.0, 2991.0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          from        to  totalCost  \\\n",
       "0  Los Angeles  New York     2991.0   \n",
       "\n",
       "                                         nodes                          costs  \n",
       "0  [Los Angeles, Dallas, Washington, New York]  [0.0, 1436.0, 2765.0, 2991.0]  "
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.dijkstra.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source, \n",
    "      targetNode: target, \n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    gds.util.asNode(sourceNode).name AS from,\n",
    "    gds.util.asNode(targetNode).name AS to,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodes,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Los Angeles\"\n",
    "target = \"New York\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "c38456b4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>from</th>\n",
       "      <th>to</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodes</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>New York</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>2991.0</td>\n",
       "      <td>[New York, Washington, Dallas, Los Angeles]</td>\n",
       "      <td>[0.0, 226.0, 1555.0, 2991.0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       from           to  totalCost  \\\n",
       "0  New York  Los Angeles     2991.0   \n",
       "\n",
       "                                         nodes                         costs  \n",
       "0  [New York, Washington, Dallas, Los Angeles]  [0.0, 226.0, 1555.0, 2991.0]  "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.dijkstra.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source, \n",
    "      targetNode: target, \n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    gds.util.asNode(sourceNode).name AS from,\n",
    "    gds.util.asNode(targetNode).name AS to,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodes,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"New York\"\n",
    "target = \"Los Angeles\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "1c6e8bba",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973b618e0>"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "CALL gds.graph.project('ds_graph', 'Station', 'TRACK', \n",
    "                      {nodeProperties: ['latitude', 'longitude'],\n",
    "                      relationshipProperties: 'track_miles'})\n",
    "\n",
    "\"\"\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "2385280a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>New York</td>\n",
       "      <td>2991.0</td>\n",
       "      <td>[Los Angeles, Dallas, Washington, New York]</td>\n",
       "      <td>[0.0, 1436.0, 2765.0, 2991.0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0    Los Angeles       New York     2991.0   \n",
       "\n",
       "                                     nodeNames                          costs  \n",
       "0  [Los Angeles, Dallas, Washington, New York]  [0.0, 1436.0, 2765.0, 2991.0]  "
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.astar.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source,\n",
    "      targetNode: target,\n",
    "      latitudeProperty: 'latitude',\n",
    "      longitudeProperty: 'longitude',\n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "     }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).name AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).name AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodeNames,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Los Angeles\"\n",
    "target = \"New York\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "17e5e42d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>New York</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>2991.0</td>\n",
       "      <td>[New York, Washington, Dallas, Los Angeles]</td>\n",
       "      <td>[0.0, 226.0, 1555.0, 2991.0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0       New York    Los Angeles     2991.0   \n",
       "\n",
       "                                     nodeNames                         costs  \n",
       "0  [New York, Washington, Dallas, Los Angeles]  [0.0, 226.0, 1555.0, 2991.0]  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.astar.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source,\n",
    "      targetNode: target,\n",
    "      latitudeProperty: 'latitude',\n",
    "      longitudeProperty: 'longitude',\n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "     }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).name AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).name AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodeNames,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"New York\"\n",
    "target = \"Los Angeles\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "7e24e991",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973b6fca0>"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Station', 'TRACK', {relationshipProperties: 'track_miles'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "a18653fd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>New York</td>\n",
       "      <td>2991.0</td>\n",
       "      <td>[Los Angeles, Dallas, Washington, New York]</td>\n",
       "      <td>[0.0, 1436.0, 2765.0, 2991.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>New York</td>\n",
       "      <td>3413.0</td>\n",
       "      <td>[Los Angeles, Berkeley, Denver, Chicago, New Y...</td>\n",
       "      <td>[0.0, 376.0, 1616.0, 2619.0, 3413.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>New York</td>\n",
       "      <td>3965.0</td>\n",
       "      <td>[Los Angeles, Berkeley, Denver, Dallas, Washin...</td>\n",
       "      <td>[0.0, 376.0, 1616.0, 2410.0, 3739.0, 3965.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>New York</td>\n",
       "      <td>4027.0</td>\n",
       "      <td>[Los Angeles, Dallas, Denver, Chicago, New York]</td>\n",
       "      <td>[0.0, 1436.0, 2230.0, 3233.0, 4027.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>New York</td>\n",
       "      <td>4274.0</td>\n",
       "      <td>[Los Angeles, Berkeley, Seattle, Denver, Chica...</td>\n",
       "      <td>[0.0, 376.0, 1174.0, 2477.0, 3480.0, 4274.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>New York</td>\n",
       "      <td>4826.0</td>\n",
       "      <td>[Los Angeles, Berkeley, Seattle, Denver, Dalla...</td>\n",
       "      <td>[0.0, 376.0, 1174.0, 2477.0, 3271.0, 4600.0, 4...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0    Los Angeles       New York     2991.0   \n",
       "1      1    Los Angeles       New York     3413.0   \n",
       "2      2    Los Angeles       New York     3965.0   \n",
       "3      3    Los Angeles       New York     4027.0   \n",
       "4      4    Los Angeles       New York     4274.0   \n",
       "5      5    Los Angeles       New York     4826.0   \n",
       "\n",
       "                                           nodeNames  \\\n",
       "0        [Los Angeles, Dallas, Washington, New York]   \n",
       "1  [Los Angeles, Berkeley, Denver, Chicago, New Y...   \n",
       "2  [Los Angeles, Berkeley, Denver, Dallas, Washin...   \n",
       "3   [Los Angeles, Dallas, Denver, Chicago, New York]   \n",
       "4  [Los Angeles, Berkeley, Seattle, Denver, Chica...   \n",
       "5  [Los Angeles, Berkeley, Seattle, Denver, Dalla...   \n",
       "\n",
       "                                               costs  \n",
       "0                      [0.0, 1436.0, 2765.0, 2991.0]  \n",
       "1               [0.0, 376.0, 1616.0, 2619.0, 3413.0]  \n",
       "2       [0.0, 376.0, 1616.0, 2410.0, 3739.0, 3965.0]  \n",
       "3              [0.0, 1436.0, 2230.0, 3233.0, 4027.0]  \n",
       "4       [0.0, 376.0, 1174.0, 2477.0, 3480.0, 4274.0]  \n",
       "5  [0.0, 376.0, 1174.0, 2477.0, 3271.0, 4600.0, 4...  "
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.yens.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source,\n",
    "      targetNode: target,\n",
    "      k: $k,\n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).name AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).name AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodeNames,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Los Angeles\"\n",
    "target = \"New York\"\n",
    "k = 10\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target, k=k)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "7e2e6fc6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>New York</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>2991.0</td>\n",
       "      <td>[New York, Washington, Dallas, Los Angeles]</td>\n",
       "      <td>[0.0, 226.0, 1555.0, 2991.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>New York</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>3413.0</td>\n",
       "      <td>[New York, Chicago, Denver, Berkeley, Los Ange...</td>\n",
       "      <td>[0.0, 794.0, 1797.0, 3037.0, 3413.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>New York</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>3965.0</td>\n",
       "      <td>[New York, Washington, Dallas, Denver, Berkele...</td>\n",
       "      <td>[0.0, 226.0, 1555.0, 2349.0, 3589.0, 3965.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>New York</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>4027.0</td>\n",
       "      <td>[New York, Chicago, Denver, Dallas, Los Angeles]</td>\n",
       "      <td>[0.0, 794.0, 1797.0, 2591.0, 4027.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>New York</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>4274.0</td>\n",
       "      <td>[New York, Chicago, Denver, Seattle, Berkeley,...</td>\n",
       "      <td>[0.0, 794.0, 1797.0, 3100.0, 3898.0, 4274.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>New York</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>4826.0</td>\n",
       "      <td>[New York, Washington, Dallas, Denver, Seattle...</td>\n",
       "      <td>[0.0, 226.0, 1555.0, 2349.0, 3652.0, 4450.0, 4...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0       New York    Los Angeles     2991.0   \n",
       "1      1       New York    Los Angeles     3413.0   \n",
       "2      2       New York    Los Angeles     3965.0   \n",
       "3      3       New York    Los Angeles     4027.0   \n",
       "4      4       New York    Los Angeles     4274.0   \n",
       "5      5       New York    Los Angeles     4826.0   \n",
       "\n",
       "                                           nodeNames  \\\n",
       "0        [New York, Washington, Dallas, Los Angeles]   \n",
       "1  [New York, Chicago, Denver, Berkeley, Los Ange...   \n",
       "2  [New York, Washington, Dallas, Denver, Berkele...   \n",
       "3   [New York, Chicago, Denver, Dallas, Los Angeles]   \n",
       "4  [New York, Chicago, Denver, Seattle, Berkeley,...   \n",
       "5  [New York, Washington, Dallas, Denver, Seattle...   \n",
       "\n",
       "                                               costs  \n",
       "0                       [0.0, 226.0, 1555.0, 2991.0]  \n",
       "1               [0.0, 794.0, 1797.0, 3037.0, 3413.0]  \n",
       "2       [0.0, 226.0, 1555.0, 2349.0, 3589.0, 3965.0]  \n",
       "3               [0.0, 794.0, 1797.0, 2591.0, 4027.0]  \n",
       "4       [0.0, 794.0, 1797.0, 3100.0, 3898.0, 4274.0]  \n",
       "5  [0.0, 226.0, 1555.0, 2349.0, 3652.0, 4450.0, 4...  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.yens.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source,\n",
    "      targetNode: target,\n",
    "      k: $k,\n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).name AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).name AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodeNames,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"New York\"\n",
    "target = \"Los Angeles\"\n",
    "k = 10\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, target=target, k=k)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "48e1cac4",
   "metadata": {},
   "source": [
    "# Lab: Neo4j - All Pairs Shortest Path, Single Source Shortest Path"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ed994717",
   "metadata": {},
   "source": [
    "## All Pairs Shorest Path - find the shortest path between all pairs of nodes; this implementation is a bit strange in that it only gives the path cost and not the actual path; "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "c53f7075",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973b56e50>"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Station', 'TRACK', {relationshipProperties: 'track_miles'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "103dbd5e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>target</th>\n",
       "      <th>distance</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Miami</td>\n",
       "      <td>Seattle</td>\n",
       "      <td>4379.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>Miami</td>\n",
       "      <td>4379.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>4194.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Miami</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>4194.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>Miami</td>\n",
       "      <td>3818.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>New York</td>\n",
       "      <td>Chicago</td>\n",
       "      <td>794.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>376.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>376.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>New York</td>\n",
       "      <td>Washington</td>\n",
       "      <td>226.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>Washington</td>\n",
       "      <td>New York</td>\n",
       "      <td>226.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>72 rows  3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         source       target  distance\n",
       "0         Miami      Seattle    4379.0\n",
       "1       Seattle        Miami    4379.0\n",
       "2      Berkeley        Miami    4194.0\n",
       "3         Miami     Berkeley    4194.0\n",
       "4   Los Angeles        Miami    3818.0\n",
       "..          ...          ...       ...\n",
       "67     New York      Chicago     794.0\n",
       "68     Berkeley  Los Angeles     376.0\n",
       "69  Los Angeles     Berkeley     376.0\n",
       "70     New York   Washington     226.0\n",
       "71   Washington     New York     226.0\n",
       "\n",
       "[72 rows x 3 columns]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "CALL gds.allShortestPaths.stream('ds_graph', \n",
    "                                 {relationshipWeightProperty: 'track_miles'}\n",
    "                                )\n",
    "YIELD sourceNodeId, targetNodeId, distance\n",
    "WITH sourceNodeId, targetNodeId, distance\n",
    "WHERE gds.util.isFinite(distance) = true\n",
    "\n",
    "WITH gds.util.asNode(sourceNodeId) AS source, gds.util.asNode(targetNodeId) AS target, distance\n",
    "WHERE source <> target\n",
    "\n",
    "RETURN source.name AS source, target.name AS target, distance\n",
    "ORDER BY distance DESC, source.name ASC, target.name ASC\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1ec506c5",
   "metadata": {},
   "source": [
    "## If we need to get the actual paths, which in most cases we would want, we will need to run Dijkstra multiple times from Python and collect the results "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "3b869d28",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_get_node_list():\n",
    "    \"get a list of nodes in the current graph\"\n",
    "    \n",
    "    query = \"match (n) return n.name as name\"\n",
    "    \n",
    "    result = session.run(query)\n",
    "    \n",
    "    node_list = []\n",
    "    \n",
    "    for r in result:\n",
    "        node_list.append(r[\"name\"])\n",
    "        \n",
    "    node_list = sorted(node_list)\n",
    "    \n",
    "    return node_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "193b7724",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973b61c70>"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Station', 'TRACK', {relationshipProperties: 'track_miles'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "291d1b96",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Berkeley', 'Chicago', 2243.0, ['Berkeley', 'Denver', 'Chicago'], [0.0, 1240.0, 2243.0]]\n",
      "['Berkeley', 'Dallas', 1812.0, ['Berkeley', 'Los Angeles', 'Dallas'], [0.0, 376.0, 1812.0]]\n",
      "['Berkeley', 'Denver', 1240.0, ['Berkeley', 'Denver'], [0.0, 1240.0]]\n",
      "['Berkeley', 'Los Angeles', 376.0, ['Berkeley', 'Los Angeles'], [0.0, 376.0]]\n",
      "['Berkeley', 'Miami', 4194.0, ['Berkeley', 'Los Angeles', 'Dallas', 'Washington', 'Miami'], [0.0, 376.0, 1812.0, 3141.0, 4194.0]]\n",
      "['Berkeley', 'New York', 3037.0, ['Berkeley', 'Denver', 'Chicago', 'New York'], [0.0, 1240.0, 2243.0, 3037.0]]\n",
      "['Berkeley', 'Seattle', 798.0, ['Berkeley', 'Seattle'], [0.0, 798.0]]\n",
      "['Berkeley', 'Washington', 3141.0, ['Berkeley', 'Los Angeles', 'Dallas', 'Washington'], [0.0, 376.0, 1812.0, 3141.0]]\n",
      "['Chicago', 'Berkeley', 2243.0, ['Chicago', 'Denver', 'Berkeley'], [0.0, 1003.0, 2243.0]]\n",
      "['Chicago', 'Dallas', 1797.0, ['Chicago', 'Denver', 'Dallas'], [0.0, 1003.0, 1797.0]]\n",
      "['Chicago', 'Denver', 1003.0, ['Chicago', 'Denver'], [0.0, 1003.0]]\n",
      "['Chicago', 'Los Angeles', 2619.0, ['Chicago', 'Denver', 'Berkeley', 'Los Angeles'], [0.0, 1003.0, 2243.0, 2619.0]]\n",
      "['Chicago', 'Miami', 2073.0, ['Chicago', 'New York', 'Washington', 'Miami'], [0.0, 794.0, 1020.0, 2073.0]]\n",
      "['Chicago', 'New York', 794.0, ['Chicago', 'New York'], [0.0, 794.0]]\n",
      "['Chicago', 'Seattle', 2306.0, ['Chicago', 'Denver', 'Seattle'], [0.0, 1003.0, 2306.0]]\n",
      "['Chicago', 'Washington', 1020.0, ['Chicago', 'New York', 'Washington'], [0.0, 794.0, 1020.0]]\n",
      "['Dallas', 'Berkeley', 1812.0, ['Dallas', 'Los Angeles', 'Berkeley'], [0.0, 1436.0, 1812.0]]\n",
      "['Dallas', 'Chicago', 1797.0, ['Dallas', 'Denver', 'Chicago'], [0.0, 794.0, 1797.0]]\n",
      "['Dallas', 'Denver', 794.0, ['Dallas', 'Denver'], [0.0, 794.0]]\n",
      "['Dallas', 'Los Angeles', 1436.0, ['Dallas', 'Los Angeles'], [0.0, 1436.0]]\n",
      "['Dallas', 'Miami', 2382.0, ['Dallas', 'Washington', 'Miami'], [0.0, 1329.0, 2382.0]]\n",
      "['Dallas', 'New York', 1555.0, ['Dallas', 'Washington', 'New York'], [0.0, 1329.0, 1555.0]]\n",
      "['Dallas', 'Seattle', 2097.0, ['Dallas', 'Denver', 'Seattle'], [0.0, 794.0, 2097.0]]\n",
      "['Dallas', 'Washington', 1329.0, ['Dallas', 'Washington'], [0.0, 1329.0]]\n",
      "['Denver', 'Berkeley', 1240.0, ['Denver', 'Berkeley'], [0.0, 1240.0]]\n",
      "['Denver', 'Chicago', 1003.0, ['Denver', 'Chicago'], [0.0, 1003.0]]\n",
      "['Denver', 'Dallas', 794.0, ['Denver', 'Dallas'], [0.0, 794.0]]\n",
      "['Denver', 'Los Angeles', 1616.0, ['Denver', 'Berkeley', 'Los Angeles'], [0.0, 1240.0, 1616.0]]\n",
      "['Denver', 'Miami', 3076.0, ['Denver', 'Chicago', 'New York', 'Washington', 'Miami'], [0.0, 1003.0, 1797.0, 2023.0, 3076.0]]\n",
      "['Denver', 'New York', 1797.0, ['Denver', 'Chicago', 'New York'], [0.0, 1003.0, 1797.0]]\n",
      "['Denver', 'Seattle', 1303.0, ['Denver', 'Seattle'], [0.0, 1303.0]]\n",
      "['Denver', 'Washington', 2023.0, ['Denver', 'Chicago', 'New York', 'Washington'], [0.0, 1003.0, 1797.0, 2023.0]]\n",
      "['Los Angeles', 'Berkeley', 376.0, ['Los Angeles', 'Berkeley'], [0.0, 376.0]]\n",
      "['Los Angeles', 'Chicago', 2619.0, ['Los Angeles', 'Berkeley', 'Denver', 'Chicago'], [0.0, 376.0, 1616.0, 2619.0]]\n",
      "['Los Angeles', 'Dallas', 1436.0, ['Los Angeles', 'Dallas'], [0.0, 1436.0]]\n",
      "['Los Angeles', 'Denver', 1616.0, ['Los Angeles', 'Berkeley', 'Denver'], [0.0, 376.0, 1616.0]]\n",
      "['Los Angeles', 'Miami', 3818.0, ['Los Angeles', 'Dallas', 'Washington', 'Miami'], [0.0, 1436.0, 2765.0, 3818.0]]\n",
      "['Los Angeles', 'New York', 2991.0, ['Los Angeles', 'Dallas', 'Washington', 'New York'], [0.0, 1436.0, 2765.0, 2991.0]]\n",
      "['Los Angeles', 'Seattle', 1174.0, ['Los Angeles', 'Berkeley', 'Seattle'], [0.0, 376.0, 1174.0]]\n",
      "['Los Angeles', 'Washington', 2765.0, ['Los Angeles', 'Dallas', 'Washington'], [0.0, 1436.0, 2765.0]]\n",
      "['Miami', 'Berkeley', 4194.0, ['Miami', 'Washington', 'Dallas', 'Los Angeles', 'Berkeley'], [0.0, 1053.0, 2382.0, 3818.0, 4194.0]]\n",
      "['Miami', 'Chicago', 2073.0, ['Miami', 'Washington', 'New York', 'Chicago'], [0.0, 1053.0, 1279.0, 2073.0]]\n",
      "['Miami', 'Dallas', 2382.0, ['Miami', 'Washington', 'Dallas'], [0.0, 1053.0, 2382.0]]\n",
      "['Miami', 'Denver', 3076.0, ['Miami', 'Washington', 'New York', 'Chicago', 'Denver'], [0.0, 1053.0, 1279.0, 2073.0, 3076.0]]\n",
      "['Miami', 'Los Angeles', 3818.0, ['Miami', 'Washington', 'Dallas', 'Los Angeles'], [0.0, 1053.0, 2382.0, 3818.0]]\n",
      "['Miami', 'New York', 1279.0, ['Miami', 'Washington', 'New York'], [0.0, 1053.0, 1279.0]]\n",
      "['Miami', 'Seattle', 4379.0, ['Miami', 'Washington', 'New York', 'Chicago', 'Denver', 'Seattle'], [0.0, 1053.0, 1279.0, 2073.0, 3076.0, 4379.0]]\n",
      "['Miami', 'Washington', 1053.0, ['Miami', 'Washington'], [0.0, 1053.0]]\n",
      "['New York', 'Berkeley', 3037.0, ['New York', 'Chicago', 'Denver', 'Berkeley'], [0.0, 794.0, 1797.0, 3037.0]]\n",
      "['New York', 'Chicago', 794.0, ['New York', 'Chicago'], [0.0, 794.0]]\n",
      "['New York', 'Dallas', 1555.0, ['New York', 'Washington', 'Dallas'], [0.0, 226.0, 1555.0]]\n",
      "['New York', 'Denver', 1797.0, ['New York', 'Chicago', 'Denver'], [0.0, 794.0, 1797.0]]\n",
      "['New York', 'Los Angeles', 2991.0, ['New York', 'Washington', 'Dallas', 'Los Angeles'], [0.0, 226.0, 1555.0, 2991.0]]\n",
      "['New York', 'Miami', 1279.0, ['New York', 'Washington', 'Miami'], [0.0, 226.0, 1279.0]]\n",
      "['New York', 'Seattle', 3100.0, ['New York', 'Chicago', 'Denver', 'Seattle'], [0.0, 794.0, 1797.0, 3100.0]]\n",
      "['New York', 'Washington', 226.0, ['New York', 'Washington'], [0.0, 226.0]]\n",
      "['Seattle', 'Berkeley', 798.0, ['Seattle', 'Berkeley'], [0.0, 798.0]]\n",
      "['Seattle', 'Chicago', 2306.0, ['Seattle', 'Denver', 'Chicago'], [0.0, 1303.0, 2306.0]]\n",
      "['Seattle', 'Dallas', 2097.0, ['Seattle', 'Denver', 'Dallas'], [0.0, 1303.0, 2097.0]]\n",
      "['Seattle', 'Denver', 1303.0, ['Seattle', 'Denver'], [0.0, 1303.0]]\n",
      "['Seattle', 'Los Angeles', 1174.0, ['Seattle', 'Berkeley', 'Los Angeles'], [0.0, 798.0, 1174.0]]\n",
      "['Seattle', 'Miami', 4379.0, ['Seattle', 'Denver', 'Chicago', 'New York', 'Washington', 'Miami'], [0.0, 1303.0, 2306.0, 3100.0, 3326.0, 4379.0]]\n",
      "['Seattle', 'New York', 3100.0, ['Seattle', 'Denver', 'Chicago', 'New York'], [0.0, 1303.0, 2306.0, 3100.0]]\n",
      "['Seattle', 'Washington', 3326.0, ['Seattle', 'Denver', 'Chicago', 'New York', 'Washington'], [0.0, 1303.0, 2306.0, 3100.0, 3326.0]]\n",
      "['Washington', 'Berkeley', 3141.0, ['Washington', 'Dallas', 'Los Angeles', 'Berkeley'], [0.0, 1329.0, 2765.0, 3141.0]]\n",
      "['Washington', 'Chicago', 1020.0, ['Washington', 'New York', 'Chicago'], [0.0, 226.0, 1020.0]]\n",
      "['Washington', 'Dallas', 1329.0, ['Washington', 'Dallas'], [0.0, 1329.0]]\n",
      "['Washington', 'Denver', 2023.0, ['Washington', 'New York', 'Chicago', 'Denver'], [0.0, 226.0, 1020.0, 2023.0]]\n",
      "['Washington', 'Los Angeles', 2765.0, ['Washington', 'Dallas', 'Los Angeles'], [0.0, 1329.0, 2765.0]]\n",
      "['Washington', 'Miami', 1053.0, ['Washington', 'Miami'], [0.0, 1053.0]]\n",
      "['Washington', 'New York', 226.0, ['Washington', 'New York'], [0.0, 226.0]]\n",
      "['Washington', 'Seattle', 3326.0, ['Washington', 'New York', 'Chicago', 'Denver', 'Seattle'], [0.0, 226.0, 1020.0, 2023.0, 3326.0]]\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.dijkstra.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source, \n",
    "      targetNode: target, \n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    gds.util.asNode(sourceNode).name AS from,\n",
    "    gds.util.asNode(targetNode).name AS to,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodes,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "nodes = my_get_node_list()\n",
    "\n",
    "all_pairs_shortest_paths = []\n",
    "\n",
    "for source in nodes:\n",
    "    \n",
    "    for target in nodes:\n",
    "        \n",
    "        if source != target:\n",
    "            \n",
    "            result = session.run(query, source=source, target=target)\n",
    "            \n",
    "            for r in result:\n",
    "\n",
    "                all_pairs_shortest_paths.append([r[\"from\"], r[\"to\"], r[\"totalCost\"], r[\"nodes\"], r[\"costs\"]])\n",
    "                \n",
    "for path in all_pairs_shortest_paths:\n",
    "    \n",
    "    print(path)\n",
    "                      "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bd454f01",
   "metadata": {},
   "source": [
    "## Single Source Shorest Path - find the shortest paths form one node pairwise with all other nodes; this implementation is a bit strange in that it only gives the path cost and not the actual path;\n",
    "\n",
    "## Update -  the newer release of this now gives the actual paths"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "a6463adf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973bcbf10>"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Station', 'TRACK', {relationshipProperties: 'track_miles'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "61843022",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>sourceNodeName</th>\n",
       "      <th>targetNodeName</th>\n",
       "      <th>totalCost</th>\n",
       "      <th>nodeNames</th>\n",
       "      <th>costs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Seattle</td>\n",
       "      <td>798.0</td>\n",
       "      <td>[Berkeley, Seattle]</td>\n",
       "      <td>[0.0, 798.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>0.0</td>\n",
       "      <td>[Berkeley]</td>\n",
       "      <td>[0.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>376.0</td>\n",
       "      <td>[Berkeley, Los Angeles]</td>\n",
       "      <td>[0.0, 376.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Denver</td>\n",
       "      <td>1240.0</td>\n",
       "      <td>[Berkeley, Denver]</td>\n",
       "      <td>[0.0, 1240.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Dallas</td>\n",
       "      <td>1812.0</td>\n",
       "      <td>[Berkeley, Los Angeles, Dallas]</td>\n",
       "      <td>[0.0, 376.0, 1812.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Chicago</td>\n",
       "      <td>2243.0</td>\n",
       "      <td>[Berkeley, Denver, Chicago]</td>\n",
       "      <td>[0.0, 1240.0, 2243.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>New York</td>\n",
       "      <td>3037.0</td>\n",
       "      <td>[Berkeley, Denver, Chicago, New York]</td>\n",
       "      <td>[0.0, 1240.0, 2243.0, 3037.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Washington</td>\n",
       "      <td>3141.0</td>\n",
       "      <td>[Berkeley, Los Angeles, Dallas, Washington]</td>\n",
       "      <td>[0.0, 376.0, 1812.0, 3141.0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>8</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Miami</td>\n",
       "      <td>4194.0</td>\n",
       "      <td>[Berkeley, Los Angeles, Dallas, Washington, Mi...</td>\n",
       "      <td>[0.0, 376.0, 1812.0, 3141.0, 4194.0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index sourceNodeName targetNodeName  totalCost  \\\n",
       "0      0       Berkeley        Seattle      798.0   \n",
       "1      1       Berkeley       Berkeley        0.0   \n",
       "2      2       Berkeley    Los Angeles      376.0   \n",
       "3      3       Berkeley         Denver     1240.0   \n",
       "4      4       Berkeley         Dallas     1812.0   \n",
       "5      5       Berkeley        Chicago     2243.0   \n",
       "6      6       Berkeley       New York     3037.0   \n",
       "7      7       Berkeley     Washington     3141.0   \n",
       "8      8       Berkeley          Miami     4194.0   \n",
       "\n",
       "                                           nodeNames  \\\n",
       "0                                [Berkeley, Seattle]   \n",
       "1                                         [Berkeley]   \n",
       "2                            [Berkeley, Los Angeles]   \n",
       "3                                 [Berkeley, Denver]   \n",
       "4                    [Berkeley, Los Angeles, Dallas]   \n",
       "5                        [Berkeley, Denver, Chicago]   \n",
       "6              [Berkeley, Denver, Chicago, New York]   \n",
       "7        [Berkeley, Los Angeles, Dallas, Washington]   \n",
       "8  [Berkeley, Los Angeles, Dallas, Washington, Mi...   \n",
       "\n",
       "                                  costs  \n",
       "0                          [0.0, 798.0]  \n",
       "1                                 [0.0]  \n",
       "2                          [0.0, 376.0]  \n",
       "3                         [0.0, 1240.0]  \n",
       "4                  [0.0, 376.0, 1812.0]  \n",
       "5                 [0.0, 1240.0, 2243.0]  \n",
       "6         [0.0, 1240.0, 2243.0, 3037.0]  \n",
       "7          [0.0, 376.0, 1812.0, 3141.0]  \n",
       "8  [0.0, 376.0, 1812.0, 3141.0, 4194.0]  "
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (n:Station {name: $source})\n",
    "CALL gds.allShortestPaths.delta.stream('ds_graph', \n",
    "                                       {sourceNode: n,\n",
    "                                        relationshipWeightProperty: 'track_miles',\n",
    "                                        delta: 3.0\n",
    "                                       }\n",
    "                                      )\n",
    "                                        \n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).name AS sourceNodeName,\n",
    "    gds.util.asNode(targetNode).name AS targetNodeName,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodeNames,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Berkeley\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a45f8643",
   "metadata": {},
   "source": [
    "## If we need to get the actual paths, which in most cases we would want, we will need to run Dijkstra multiple times from Python and collect the results "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "86553ebd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973b61b80>"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Station', 'TRACK', {relationshipProperties: 'track_miles'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "dae16f35",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Berkeley', 'Chicago', 2243.0, ['Berkeley', 'Denver', 'Chicago'], [0.0, 1240.0, 2243.0]]\n",
      "['Berkeley', 'Dallas', 1812.0, ['Berkeley', 'Los Angeles', 'Dallas'], [0.0, 376.0, 1812.0]]\n",
      "['Berkeley', 'Denver', 1240.0, ['Berkeley', 'Denver'], [0.0, 1240.0]]\n",
      "['Berkeley', 'Los Angeles', 376.0, ['Berkeley', 'Los Angeles'], [0.0, 376.0]]\n",
      "['Berkeley', 'Miami', 4194.0, ['Berkeley', 'Los Angeles', 'Dallas', 'Washington', 'Miami'], [0.0, 376.0, 1812.0, 3141.0, 4194.0]]\n",
      "['Berkeley', 'New York', 3037.0, ['Berkeley', 'Denver', 'Chicago', 'New York'], [0.0, 1240.0, 2243.0, 3037.0]]\n",
      "['Berkeley', 'Seattle', 798.0, ['Berkeley', 'Seattle'], [0.0, 798.0]]\n",
      "['Berkeley', 'Washington', 3141.0, ['Berkeley', 'Los Angeles', 'Dallas', 'Washington'], [0.0, 376.0, 1812.0, 3141.0]]\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.dijkstra.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source, \n",
    "      targetNode: target, \n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    gds.util.asNode(sourceNode).name AS from,\n",
    "    gds.util.asNode(targetNode).name AS to,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodes,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "nodes = my_get_node_list()\n",
    "\n",
    "single_source_shortest_paths = []\n",
    "\n",
    "source = \"Berkeley\"\n",
    "    \n",
    "for target in nodes:\n",
    "\n",
    "    if source != target:\n",
    "\n",
    "        result = session.run(query, source=source, target=target)\n",
    "\n",
    "        for r in result:\n",
    "\n",
    "            single_source_shortest_paths.append([r[\"from\"], r[\"to\"], r[\"totalCost\"], r[\"nodes\"], r[\"costs\"]])\n",
    "                \n",
    "for path in single_source_shortest_paths:\n",
    "    \n",
    "    print(path)\n",
    "                      "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3a0036fb",
   "metadata": {},
   "source": [
    "## You try it - find the single source shortest paths from Los Angeles; solutions in graph_path_algorithms_solutions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "95697d70",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Los Angeles', 'Berkeley', 376.0, ['Los Angeles', 'Berkeley'], [0.0, 376.0]]\n",
      "['Los Angeles', 'Chicago', 2619.0, ['Los Angeles', 'Berkeley', 'Denver', 'Chicago'], [0.0, 376.0, 1616.0, 2619.0]]\n",
      "['Los Angeles', 'Dallas', 1436.0, ['Los Angeles', 'Dallas'], [0.0, 1436.0]]\n",
      "['Los Angeles', 'Denver', 1616.0, ['Los Angeles', 'Berkeley', 'Denver'], [0.0, 376.0, 1616.0]]\n",
      "['Los Angeles', 'Miami', 3818.0, ['Los Angeles', 'Dallas', 'Washington', 'Miami'], [0.0, 1436.0, 2765.0, 3818.0]]\n",
      "['Los Angeles', 'New York', 2991.0, ['Los Angeles', 'Dallas', 'Washington', 'New York'], [0.0, 1436.0, 2765.0, 2991.0]]\n",
      "['Los Angeles', 'Seattle', 1174.0, ['Los Angeles', 'Berkeley', 'Seattle'], [0.0, 376.0, 1174.0]]\n",
      "['Los Angeles', 'Washington', 2765.0, ['Los Angeles', 'Dallas', 'Washington'], [0.0, 1436.0, 2765.0]]\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (source:Station {name: $source}), (target:Station {name: $target})\n",
    "CALL gds.shortestPath.dijkstra.stream(\n",
    "    'ds_graph', \n",
    "    { sourceNode: source, \n",
    "      targetNode: target, \n",
    "      relationshipWeightProperty: 'track_miles'\n",
    "    }\n",
    ")\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    gds.util.asNode(sourceNode).name AS from,\n",
    "    gds.util.asNode(targetNode).name AS to,\n",
    "    totalCost,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).name] AS nodes,\n",
    "    costs\n",
    "ORDER BY index\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "nodes = my_get_node_list()\n",
    "\n",
    "single_source_shortest_paths = []\n",
    "\n",
    "source = \"Los Angeles\"\n",
    "    \n",
    "for target in nodes:\n",
    "\n",
    "    if source != target:\n",
    "\n",
    "        result = session.run(query, source=source, target=target)\n",
    "\n",
    "        for r in result:\n",
    "\n",
    "            single_source_shortest_paths.append([r[\"from\"], r[\"to\"], r[\"totalCost\"], r[\"nodes\"], r[\"costs\"]])\n",
    "                \n",
    "for path in single_source_shortest_paths:\n",
    "    \n",
    "    print(path)\n",
    "                  \n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2bdb850e",
   "metadata": {},
   "source": [
    "# Lab: Neo4j - Minimum Spanning Tree"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f9f4367f",
   "metadata": {},
   "source": [
    "## Minimum Spanning Tree - find a tree structure path that will visit all nodes in the graph with smallest cost; the algorithm actually writes new relations to the graph for the MST"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "d45d97e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_wipe_out_mst_relationships():\n",
    "    \"wipe out mst relationships\"\n",
    "    \n",
    "    query = \"match (node)-[relationship:MST]->() delete relationship\"\n",
    "    session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "0181e04a",
   "metadata": {},
   "outputs": [],
   "source": [
    "my_neo4j_wipe_out_mst_relationships()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "23d8d1ce",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973b74c10>"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "CALL gds.graph.project('ds_graph', 'Station', \n",
    "                        {\n",
    "                            TRACK: {\n",
    "                                properties: 'track_miles',\n",
    "                                orientation: 'UNDIRECTED'\n",
    "                            }\n",
    "                        }\n",
    "                       )\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "e4d5d439",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>preProcessingMillis</th>\n",
       "      <th>computeMillis</th>\n",
       "      <th>writeMillis</th>\n",
       "      <th>effectiveNodeCount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   preProcessingMillis  computeMillis  writeMillis  effectiveNodeCount\n",
       "0                    0              0            5                   9"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Station {name: $source})\n",
    "CALL gds.spanningTree.write('ds_graph',\n",
    "                            {\n",
    "                                sourceNode: n,\n",
    "                                relationshipWeightProperty: 'track_miles',\n",
    "                                writeProperty: 'writeCost',\n",
    "                                writeRelationshipType: 'MST'\n",
    "                            }\n",
    "                           )\n",
    "YIELD preProcessingMillis, computeMillis, writeMillis, effectiveNodeCount\n",
    "RETURN preProcessingMillis, computeMillis, writeMillis, effectiveNodeCount;\n",
    "\"\"\"\n",
    "\n",
    "source = \"Berkeley\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "70abdb06",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>destination</th>\n",
       "      <th>cost</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Seattle</td>\n",
       "      <td>798.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>376.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Denver</td>\n",
       "      <td>1240.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Denver</td>\n",
       "      <td>Chicago</td>\n",
       "      <td>1003.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>New York</td>\n",
       "      <td>794.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>New York</td>\n",
       "      <td>Washington</td>\n",
       "      <td>226.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Washington</td>\n",
       "      <td>Miami</td>\n",
       "      <td>1053.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Denver</td>\n",
       "      <td>Dallas</td>\n",
       "      <td>794.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       source  destination    cost\n",
       "0    Berkeley      Seattle   798.0\n",
       "1    Berkeley  Los Angeles   376.0\n",
       "2    Berkeley       Denver  1240.0\n",
       "3      Denver      Chicago  1003.0\n",
       "4     Chicago     New York   794.0\n",
       "5    New York   Washington   226.0\n",
       "6  Washington        Miami  1053.0\n",
       "7      Denver       Dallas   794.0"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH path = (n:Station {name: $source})-[:MST*]-()\n",
    "WITH relationships(path) AS rels\n",
    "UNWIND rels AS rel\n",
    "WITH DISTINCT rel AS rel\n",
    "RETURN startNode(rel).name AS source, endNode(rel).name AS destination, rel.writeCost AS cost\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Berkeley\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aff4aa47",
   "metadata": {},
   "source": [
    "## You try it - find the Minimum Spanning Tree with the source at Los Angeles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "a2d1e356",
   "metadata": {},
   "outputs": [],
   "source": [
    "my_neo4j_wipe_out_mst_relationships() # Need to remove existing MST"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "e2401c60",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973b74e50>"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "CALL gds.graph.project('ds_graph', 'Station', \n",
    "                        {\n",
    "                            TRACK: {\n",
    "                                properties: 'track_miles',\n",
    "                                orientation: 'UNDIRECTED'\n",
    "                            }\n",
    "                        }\n",
    "                       )\n",
    "                                \n",
    "\"\"\"\n",
    "\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "da8e4afd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>preProcessingMillis</th>\n",
       "      <th>computeMillis</th>\n",
       "      <th>writeMillis</th>\n",
       "      <th>effectiveNodeCount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   preProcessingMillis  computeMillis  writeMillis  effectiveNodeCount\n",
       "0                    0              1            5                   9"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Station {name: $source})\n",
    "CALL gds.spanningTree.write('ds_graph',\n",
    "                            {\n",
    "                                sourceNode: n,\n",
    "                                relationshipWeightProperty: 'track_miles',\n",
    "                                writeProperty: 'writeCost',\n",
    "                                writeRelationshipType: 'MST'\n",
    "                            }\n",
    "                           )\n",
    "YIELD preProcessingMillis, computeMillis, writeMillis, effectiveNodeCount\n",
    "RETURN preProcessingMillis, computeMillis, writeMillis, effectiveNodeCount;\n",
    "\"\"\"\n",
    "\n",
    "source = \"Los Angeles\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "3e0b9a2d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>destination</th>\n",
       "      <th>cost</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>Berkeley</td>\n",
       "      <td>376.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Seattle</td>\n",
       "      <td>798.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>Denver</td>\n",
       "      <td>1240.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Denver</td>\n",
       "      <td>Dallas</td>\n",
       "      <td>794.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Denver</td>\n",
       "      <td>Chicago</td>\n",
       "      <td>1003.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>New York</td>\n",
       "      <td>794.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>New York</td>\n",
       "      <td>Washington</td>\n",
       "      <td>226.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Washington</td>\n",
       "      <td>Miami</td>\n",
       "      <td>1053.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        source destination    cost\n",
       "0  Los Angeles    Berkeley   376.0\n",
       "1     Berkeley     Seattle   798.0\n",
       "2     Berkeley      Denver  1240.0\n",
       "3       Denver      Dallas   794.0\n",
       "4       Denver     Chicago  1003.0\n",
       "5      Chicago    New York   794.0\n",
       "6     New York  Washington   226.0\n",
       "7   Washington       Miami  1053.0"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH path = (n:Station {name: $source})-[:MST*]-()\n",
    "WITH relationships(path) AS rels\n",
    "UNWIND rels AS rel\n",
    "WITH DISTINCT rel AS rel\n",
    "RETURN startNode(rel).name AS source, endNode(rel).name AS destination, rel.writeCost AS cost\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Los Angeles\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cb536a29",
   "metadata": {},
   "source": [
    "# Lab: Neo4j - Random Walk"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9a68828a",
   "metadata": {},
   "source": [
    "## Random Walk - given a path size, randomly walk through nodes until we hit the path size"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "f04ba6f4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f2973b84490>"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"CALL gds.graph.drop('ds_graph', false) yield graphName\"\n",
    "session.run(query)\n",
    "\n",
    "query = \"CALL gds.graph.project('ds_graph', 'Station', 'TRACK', {relationshipProperties: 'track_miles'})\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "ab1225d0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Berkeley</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Denver</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Chicago</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>New York</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Washington</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Miami</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Washington</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Dallas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Denver</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Seattle</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         node\n",
       "0    Berkeley\n",
       "1      Denver\n",
       "2     Chicago\n",
       "3    New York\n",
       "4  Washington\n",
       "5       Miami\n",
       "6  Washington\n",
       "7      Dallas\n",
       "8      Denver\n",
       "9     Seattle"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (home:Station {name: $source})\n",
    "WITH COLLECT(home) as sourceNodes\n",
    "CALL gds.randomWalk.stream('ds_graph',\n",
    "                                {sourceNodes: sourceNodes,\n",
    "                                 walkLength: $path_size,\n",
    "                                 walksPerNode: 1,\n",
    "                                 concurrency: 1\n",
    "                                }\n",
    "                               )\n",
    "YIELD nodeIds\n",
    "UNWIND nodeIds AS nodeId\n",
    "RETURN gds.util.asNode(nodeId).name AS node\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Berkeley\"\n",
    "\n",
    "path_size = 10\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, path_size=path_size)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5a0cace0",
   "metadata": {},
   "source": [
    "## Re-run several times, should get different random walks each time"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b723c8ff",
   "metadata": {},
   "source": [
    "## You try it - take a random walk from the Los Angeles node with path size of 10; solution is in graph_path_algorithms_solutions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "592bd648",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Los Angeles</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Berkeley</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Denver</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Berkeley</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Denver</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Dallas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Washington</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>New York</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          node\n",
       "0  Los Angeles\n",
       "1     Berkeley\n",
       "2      Seattle\n",
       "3       Denver\n",
       "4      Seattle\n",
       "5     Berkeley\n",
       "6       Denver\n",
       "7       Dallas\n",
       "8   Washington\n",
       "9     New York"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (home:Station {name: $source})\n",
    "WITH COLLECT(home) as sourceNodes\n",
    "CALL gds.randomWalk.stream('ds_graph',\n",
    "                                {sourceNodes: sourceNodes,\n",
    "                                 walkLength: $path_size,\n",
    "                                 walksPerNode: 1,\n",
    "                                 concurrency: 1\n",
    "                                }\n",
    "                               )\n",
    "YIELD nodeIds\n",
    "UNWIND nodeIds AS nodeId\n",
    "RETURN gds.util.asNode(nodeId).name AS node\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "source = \"Los Angeles\"\n",
    "\n",
    "path_size = 10\n",
    "\n",
    "my_neo4j_run_query_pandas(query, source=source, path_size=path_size)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
